/*
 * Розгалуження
 *
 * - Інструкція if
 * - Інструкція if...else
 * - Блок else...if
 * - Тернарний оператор
 */

/*
TODO: Запросіть у користувача число, якщо число дорівнює 10,
TODO: то виведіть 'Вірно', інакше виведіть 'Невірно'.
*/

// const userNumber = 0;

/*
TODO: Перевірте чи є гроші на балансі, якщо є то виведіть до консолі 'Positive', інакше 'Negative'.
*/

// const balance = 1000;

/*
TODO: В залежності від значення в змінній login, потрібно формувати відповідне повідомлення.
TODO: Співробітник - Привіт
TODO: Директор - Вітаю
TODO: '' - Немає логіну
TODO: В інших випадках повідомлення має бути порожнім.
*/

// const login = 'Співробітник';
// let message;

// console.log(message);

/*
TODO: Перепишіть конструкцію if з використанням тернарного оператора.
*/

// const a = 1;
// const b = 1;

// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Багато';
// }

// console.log(result);

/*
TODO: Перепишіть if..else за допомогою декількох тернарних операторів.
*/

// const login = 'Директор';
// let message;

// if (login === 'Співробітник') {
//   message = 'Привіт';
// } else if (login === 'Директор') {
//   message = 'Вітаю';
// } else if (login === '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// console.log(message);
